## Plan Result (sbox_backendappgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw"
        name                              = "cft-aks00-sandbox-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-StuartBJustice" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-StuartBJustice" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-darrenbayliss-dev2" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-darrenbayliss-dev2" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-endakelly" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-endakelly" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-hub-ngfw-poc" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-hub-ngfw-poc" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-hw469" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-hw469" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-jefex7" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-jefex7" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-matthewsearle01-v3" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-matthewsearle01-v3" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-mokainosjavaapp" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-mokainosjavaapp" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-mokainosspringboot" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-mokainosspringboot" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-msl8r" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-msl8r" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-ozzyib" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-ozzyib" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-peterpilgrim-v2" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-peterpilgrim-v2" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-rajivkapoor1" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-rajivkapoor1" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-raraybould" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-raraybould" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-rhodrif" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-rhodrif" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-ssian2" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-ssian2" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/labs-zc-hmcts" -> null
          - ip_addresses = [
              - "10.2.11.250",
              - "10.2.9.250",
            ] -> null
          - name         = "labs-zc-hmcts" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/bulk-scan-orchestrator" -> null
          - name                                = "bulk-scan-orchestrator" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/bulk-scan-orchestrator" -> null
          - probe_name                          = "bulk-scan-orchestrator" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/bulk-scan-payment-processor" -> null
          - name                                = "bulk-scan-payment-processor" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/bulk-scan-payment-processor" -> null
          - probe_name                          = "bulk-scan-payment-processor" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/bulk-scan-processor" -> null
          - name                                = "bulk-scan-processor" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/bulk-scan-processor" -> null
          - probe_name                          = "bulk-scan-processor" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/bulk-scan-sample-app" -> null
          - name                                = "bulk-scan-sample-app" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/bulk-scan-sample-app" -> null
          - probe_name                          = "bulk-scan-sample-app" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/div-emca" -> null
          - name                                = "div-emca" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/div-emca" -> null
          - probe_name                          = "div-emca" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/draft-store-service" -> null
          - name                                = "draft-store-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/draft-store-service" -> null
          - probe_name                          = "draft-store-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/fpl-case-service" -> null
          - name                                = "fpl-case-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/fpl-case-service" -> null
          - probe_name                          = "fpl-case-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/ia-bail-case-api" -> null
          - name                                = "ia-bail-case-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/ia-bail-case-api" -> null
          - probe_name                          = "ia-bail-case-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/ia-case-api" -> null
          - name                                = "ia-case-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/ia-case-api" -> null
          - probe_name                          = "ia-case-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/ia-case-documents-api" -> null
          - name                                = "ia-case-documents-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/probes/ia-case-documents-api" -> null
          - probe_name                          = "ia-case-documents-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/b72ab7b7-723f-4b18

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

       = "rd-profile-sync"
          + id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/requestRoutingRules/rd-profile-sync"
          + name                       = "rd-profile-sync"
          + priority                   = 120
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/rd-user-profile-api"
          + backend_address_pool_name  = "rd-user-profile-api"
          + backend_http_settings_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/rd-user-profile-api"
          + backend_http_settings_name = "rd-user-profile-api"
          + http_listener_id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/httpListeners/rd-user-profile-api"
          + http_listener_name         = "rd-user-profile-api"
          + id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/requestRoutingRules/rd-user-profile-api"
          + name                       = "rd-user-profile-api"
          + priority                   = 110
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/sscs-evidence-share"
          + backend_address_pool_name  = "sscs-evidence-share"
          + backend_http_settings_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/sscs-evidence-share"
          + backend_http_settings_name = "sscs-evidence-share"
          + http_listener_id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/httpListeners/sscs-evidence-share"
          + http_listener_name         = "sscs-evidence-share"
          + id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/requestRoutingRules/sscs-evidence-share"
          + name                       = "sscs-evidence-share"
          + priority                   = 150
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendAddressPools/sscs-tribunals-api"
          + backend_address_pool_name  = "sscs-tribunals-api"
          + backend_http_settings_id   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/backendHttpSettingsCollection/sscs-tribunals-api"
          + backend_http_settings_name = "sscs-tribunals-api"
          + http_listener_id           = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/httpListeners/sscs-tribunals-api"
          + http_listener_name         = "sscs-tribunals-api"
          + id                         = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw/requestRoutingRules/sscs-tribunals-api"
          + name                       = "sscs-tribunals-api"
          + priority                   = 140
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_http_settings_id    = (known after apply)
          + http_listener_id            = (known after apply)
          + http_listener_name          = "dg-docmosis-redirect"
          + id                          = (known after apply)
          + name                        = "dg-docmosis-redirect"
          + priority                    = 355
          + redirect_configuration_id   = (known after apply)
          + redirect_configuration_name = "dg-docmosis-redirect"
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "bulk-scan-orchestrator"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "bulk-scan-orchestrator"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "bulk-scan-orchestrator"
          + id                         = (known after apply)
          + name                       = "bulk-scan-orchestrator"
          + priority                   = 290
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "bulk-scan-payment-processor"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "bulk-scan-payment-processor"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "bulk-scan-payment-processor"
          + id                         = (known after apply)
          + name                       = "bulk-scan-payment-processor"
          + priority                   = 310
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "bulk-scan-processor"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "bulk-scan-processor"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "bulk-scan-processor"
          + id                         = (known after apply)
          + name                       = "bulk-scan-processor"
          + priority                   = 280
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "bulk-scan-sample-app"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "bulk-scan-sample-app"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "bulk-scan-sample-app"
          + id                         = (known after apply)
          + name                       = "bulk-scan-sample-app"
          + priority                   = 300
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dg-docmosis"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dg-docmosis"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dg-docmosis"
          + id                         = (known after apply)
          + name                       = "dg-docmosis"
          + priority                   = 350
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-api"
          + id                         = (known after apply)
          + name                       = "idam-api"
          + priority                   = 200
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-api-sprod"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-api-sprod"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-api-sprod"
          + id                         = (known after apply)
          + name                       = "idam-api-sprod"
          + priority                   = 220
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-hmcts-access"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-hmcts-access"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-hmcts-access"
          + id                         = (known after apply)
          + name                       = "idam-hmcts-access"
          + priority                   = 260
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-testing-support-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-testing-support-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-testing-support-api"
          + id                         = (known after apply)
          + name                       = "idam-testing-support-api"
          + priority                   = 240
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-user-dashboard"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-user-dashboard"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-user-dashboard"
          + id                         = (known after apply)
          + name                       = "idam-user-dashboard"
          + priority                   = 250
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-user-profile-bridge"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-user-profile-bridge"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-user-profile-bridge"
          + id                         = (known after apply)
          + name                       = "idam-user-profile-bridge"
          + priority                   = 270
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-web-admin"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-web-admin"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-web-admin"
          + id                         = (known after apply)
          + name                       = "idam-web-admin"
          + priority                   = 210
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-web-admin-sprod"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-web-admin-sprod"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-web-admin-sprod"
          + id                         = (known after apply)
          + name                       = "idam-web-admin-sprod"
          + priority                   = 230
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "labs-apps-njs"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "labs-apps-njs"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "labs-apps-njs"
          + id                         = (known after apply)
          + name                       = "labs-apps-njs"
          + priority                   = 190
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reform-scan-blob-router"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reform-scan-blob-router"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reform-scan-blob-router"
          + id                         = (known after apply)
          + name                       = "reform-scan-blob-router"
          + priority                   = 330
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reform-scan-notification-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reform-scan-notification-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reform-scan-notification-service"
          + id                         = (known after apply)
          + name                       = "reform-scan-notification-service"
          + priority                   = 340
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rpe-send-letter-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rpe-send-letter-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rpe-send-letter-service"
          + id                         = (known after apply)
          + name                       = "rpe-send-letter-service"
          + priority                   = 320
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (46 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-sbox-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-sandbox-agw|app-gw-storage-account"
        name                           = "app-gw-storage-account"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1999,"Program":"tfcmt","SHA1":"","Target":"sbox_backendappgateway","Vars":{}} -->